from math import *

# 计算毛坯直径
k = pi * 92 * 3  # 拉深A1
l = pi / 4 * (2 * pi * 90 + 8)  # 拉深A2
m = pi / 4 * 90 * 90  # 拉深A3
n = 1.29 * pi * (95 / 2 + 93.17 / 2)  # 梯形台的侧面积
o = (92 + 93.17) / 2 * 45 / 180 * pi * 2  # 半径为2的部分
p = k + l + m + n + o
print('表面积=' + str(p) + 'mm')
# q = (8212.8-p)/8212.8*100
# print('误差=' + str(round(q,4)) + '%')
r = (4 / pi * p)**0.5
print('毛坯直径=' + str(r) + 'mm')


# 计算预冲孔直径d0
d = 58  # 中性层直径D
e = 7  # 翻孔高度H
f = pi / 2  # 翻孔处内圆角r
g = 1  # 板料厚度δ
h = d - 2 * (e - 0.43 * f - 0.72 * g)  # 预冲孔直径计算公式
print('预冲孔直径=' + str(h) + 'mm')

# 计算极限翻边高度H_max
i = 0.68  # 极限翻孔系数
j = d / 2 * (1 - i) + 0.43 * f + 0.72 * g
print('极限翻孔高度=' + str(j) + 'mm')

s = pi * ((102.2 / 2)**2)
t = (102.2 + 2) * (102.2 + 0.8)
u = s / t * 100
print('材料利用率=' + str(round(u, 2)) + '%')
